"""
Модуль для зберігання глобальних параметрів програми.

Цей модуль містить змінну `GLOBAL_VAR`, яка використовується для координації
взаємодії між потоками в програмі. Зокрема, ця змінна визначає, чи активний
режим запису відео.

Змінні:
- `GLOBAL_VAR` (bool): Глобальна змінна, що використовується для активації
  або деактивації запису відео.
  - `True` — режим запису активний.
  - `False` — режим запису неактивний.

Примітки:
- Цей модуль призначений для використання як спільний ресурс між потоками
  запису відео (`record_video`) та детекції автомобілів (`detect_cars_from_video`).
- Початкове значення `False` вказує, що запис відео відразу після запуску
  програми вимкнено.
"""
GLOBAL_VAR = False

